core/src/main/resources/order_template/modvas_streaming.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{2}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{3}</OrderUserId>
         <OrderDateTime>{1}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODVAS</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESS{2}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
             <OrderItem>
               <OrderItemType>SERVICE</OrderItemType>
               <OrderItemAction>{4}</OrderItemAction>
               <OrderItemId>SERVICE{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
                <Attributes>
                   <Attribute>
                     <Name>ServiceId</Name>
                     <Value>Streaming</Value>
                  </Attribute>
              </Attributes>
            </OrderItem>            
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDN{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
	    </OrderItem>
	 </OrderItems>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>